KenKenMkIISR/rp2040-ntsc-pacman/rp2040_ntsc_pacman.c
//マクロ設定　仮想マップの読み出し、書き込み
#define GETMAP(x,y) map[(y)*MAPXSIZE+(x)]
#define SETMAP(x,y,d) map[(y)*MAPXSIZE+(x)]=(d)

#define PWM_WRAP 5040 // 157.5MHz/31.25KHz
uint pwm_slice_num;

void sound_on(uint16_t f){
	f<<=1;
	pwm_set_clkdiv_int_frac(pwm_slice_num, f>>4, f&15);
	pwm_set_enabled(pwm_slice_num, true);
}
void sound_off(void){
	pwm_set_enabled(pwm_slice_num, false);
}

void wait60thsec(unsigned short n){
	// 60分のn秒ウェイト（ビデオ画面の最下行信号出力終了まで待つ）
	drawcount=0;
	while(drawcount<n) asm("wfi");
}
unsigned char startkeycheck(unsigned short n){
	// 60分のn秒ウェイト
	// スタートボタンが押されればすぐ戻る
	//　戻り値　スタートボタン押されれば1、押されなければ0
	drawcount=0;
	while(drawcount<n){
		if(!gpio_get(GPIO_KEYSTART)) return 1;
		asm("wfi");
	}
	return 0;
}
void playmusic60thsec(void){
	//60分の1秒ウェイト後、現在演奏中の曲を1つ進める
	wait60thsec(1); //60分の1秒ウェイト
	if(music.stop) return; //演奏終了済み
	music.count--;
	if(music.count>0) return;

	//次の音を鳴らす
	if(*music.p==254){ //曲終了
		music.stop=1;
		sound_off();
		return;
	}
	if(*music.p==255) sound_off(); //休符
	else sound_on(sounddata[*music.p]); //周期データ
	music.p++;
	music.count=*music.p; //音符長さ
	music.p++;
}
void startmusic(unsigned char *m){
	music.p=m;
	music.count=1;
	music.stop=0;
}
/*
//　単に曲演奏　（今回は未使用）
void playmusic(unsigned char *m){
	startmusic(m);
	while(music.stop==0){
		playmusic60thsec();
	}
}	
*/

// 横m*縦nドットのキャラクターを座標x,yに表示
// unsigned char bmp[m*n]配列に、単純にカラー番号を並べる
// カラー番号が0の部分は透明色として扱う
void putbmpmn_map(int x,int y,char m,char n,const unsigned char bmp[])
{// ゲームのマップ内だけに描画の場合はこちら（マップ外にはみ出した部分は表示しない）
	int i,j;
	unsigned char *vp;
	const unsigned char *p;
	if(x<=-m || x>=MAPXSIZE*8 || y<=-n || y>=MAPYSIZE*8) return; //画面外
	if(y<0){ //画面上部に切れる場合
		i=0;
		p=bmp-y*m;
	}
	else{
		i=y;
		p=bmp;
	}
	for(;i<y+n;i++){
		if(i>=MAPYSIZE*8) return; //画面下部に切れる場合
		if(x<0){ //画面左に切れる場合は残る部分のみ描画
			j=0;
			p+=-x;
			vp=GVRAM+i*X_RES;
		}
		else{
			j=x;
			vp=GVRAM+i*X_RES+x;
		}
		for(;j<x+m;j++){
			if(j>=MAPXSIZE*8){ //画面右に切れる場合
				p+=x+m-j;
				break;
			}
			if(*p!=0){ //カラー番号が0の場合、透明として処理
				*vp=*p;
			}
			p++;
			vp++;
		}
	}
}

void putpacman(void){
	//パックマンの表示
	unsigned char a;
	pacman.animcount--;
	if(pacman.animcount==0){
		pacman.animcount=pacman.animcount0;
		pacman.animvalue++;
		if(pacman.animvalue==6) pacman.animvalue=0;
	}
	if(pacman.animvalue==0) a=0;
	else if(pacman.animvalue<=3) a=pacman.dir*3+pacman.animvalue;
	else a=pacman.dir*3+6-pacman.animvalue;
	putbmpmn_map((int)(pacman.x/256)-3,(int)(pacman.y/256)-3,XWIDTH_PACMAN,YWIDTH_PACMAN,Pacmanbmp[a]);
}
void putmonster(_Character *p){
	//モンスター表示　p:キャラクターのポインタ指定
	unsigned char i;//モンスターの足のパターン（2種類）
	if(gamecount & 4) i=0;
	else i=1;
	switch(p->status){
		case IJIKE:
			if(p->modecount>180 || gamecount & 8)
				putbmpmn_map((int)(p->x/256)-3,(int)(p->y/256)-3,XWIDTH_MONSTER,YWIDTH_MONSTER,Ijikebmp[i]);
			else
				//白で点滅
				putbmpmn_map((int)(p->x/256)-3,(int)(p->y/256)-3,XWIDTH_MONSTER,YWIDTH_MONSTER,Ijikebmp[2+i]);
			break;
		case MEDAMA:
			putbmpmn_map((int)(p->x/256)-3,(int)(p->y/256)-3,XWIDTH_MONSTER,YWIDTH_MONSTER,Medamabmp[p->dir]);
			break;
		default:
			putbmpmn_map((int)(p->x/256)-3,(int)(p->y/256)-3,XWIDTH_MONSTER,YWIDTH_MONSTER,Monsterbmp[p->no*8+p->dir*2+i]);
	}
}
void blinkpowercookie(){
	//パワーえさの点滅
	if(gamecount & 0x10){
		set_palette(COLOR_POWERCOOKIE,0,50,50);
	}
	else{
		set_palette(COLOR_POWERCOOKIE,0,255,255);
	}
}
unsigned char getfruitno(unsigned char s){
	// s面のフルーツ番号を返す
	if(s<13) return fruit[s-1];
	else return fruit[12];
}
void putfruit(void){
	// フルーツ表示
	putbmpmn_map(FRUITX*8-2,FRUITY*8-3,12,14,Fruitbmp[fruitno]);
}
void putmapchar(unsigned char x,unsigned char y){
	//マップ上のコードに応じたものを表示
	unsigned char d;

	d=GETMAP(x,y);
	if(d==MAP_COOKIE) g_putfont(x*8,y*8,COLOR_COOKIE,0,CODE_COOKIE);
	else if(d==MAP_POWERCOOKIE) g_putfont(x*8,y*8,COLOR_POWERCOOKIE,0,CODE_POWERCOOKIE);
	else if(d==MAP_DOOR) g_putfont(x*8,y*8,COLOR_DOOR,0,CODE_DOOR);
	else if(d==MAP_WALL) g_putfont(x*8,y*8,COLOR_WALL,0,scenedata[y*MAPXSIZE+x]);
	else g_putfont(x*8,y*8,0,0,' ');
}
void setfruit(unsigned char f){
	// f 0:フルーツ削除&表示消去、1:フルーツ発生&表示
	if(f){
		SETMAP(FRUITX,FRUITY,MAP_FRUIT);
	}
	else{
		SETMAP(FRUITX,FRUITY,MAP_NONE);
		putmapchar(FRUITX-1,FRUITY-1);
		putmapchar(FRUITX  ,FRUITY-1);
		putmapchar(FRUITX+1,FRUITY-1);
		putmapchar(FRUITX-1,FRUITY  );
		putmapchar(FRUITX  ,FRUITY  );
		putmapchar(FRUITX+1,FRUITY  );
		putmapchar(FRUITX-1,FRUITY+1);
		putmapchar(FRUITX  ,FRUITY+1);
		putmapchar(FRUITX+1,FRUITY+1);
	}
}
void getfruit(){
	// フルーツ食べた

	score+=fruitscore[fruitno];
	fruitcount=0;
	setfruit(0);
	fruitsound=22000;
	fruitsoundcount=20;
	fruitscoretimer=TIMER_FRUITSCORE;
}

void displayscore(){
	if(score>highscore) highscore=score;
	g_printnum2(21*8,3*8,7,0,highscore,6);
	g_printnum2(21*8,7*8,7,0,score,6);
}
void displayplayers(){
	//プレイヤー残数表示
	unsigned char i;
	for(i=0;i<player && i<5;i++) g_putbmpmn(22*8+i*16,23*8,XWIDTH_PACMAN,YWIDTH_PACMAN,Pacmanbmp[11]);
	for(;i<4;i++) g_clrbmpmn(22*8+i*16,23*8,XWIDTH_PACMAN,YWIDTH_PACMAN);
}
void displayfruits(){
	//画面右側に8ステージ分のフルーツを表示
	unsigned char i,no;
	for(i=0;i<8 && i<stage;i++){
		no=getfruitno(stage-i);
		g_clrbmpmn (22*8+(i%4)*16,15*8+(i/4)*16,12,14);
		g_putbmpmn(22*8+(i%4)*16,15*8+(i/4)*16,12,14,Fruitbmp[no]);
	}
}
void putmap(void){
	//通路、えさ、パワーえさの表示
	unsigned char c,*p,*mapp;
	int i,j,k;
	g_clearscreen();
	p=scenedata;
	mapp=map;
	cookie=0;
	for(i=0;i<MAPYSIZE;i++){
		for(j=0;j<MAPXSIZE;j++){
			if(*p<=0x8d){
				*mapp=MAP_WALL; //壁
				g_putfont(j*8,i*8,COLOR_WALL,0,*p);
			}
			else if(*p==CODE_DOOR){
				*mapp=MAP_DOOR; //ドア
				g_putfont(j*8,i*8,COLOR_DOOR,0,CODE_DOOR);
			}
			else if(*p==CODE_COOKIE){
				*mapp=MAP_COOKIE; //えさ
				g_putfont(j*8,i*8,COLOR_COOKIE,0,CODE_COOKIE);
				cookie++;
			}
			else if(*p==CODE_POWERCOOKIE){
				*mapp=MAP_POWERCOOKIE; //パワーえさ
				g_putfont(j*8,i*8,COLOR_POWERCOOKIE,0,CODE_POWERCOOKIE);
				cookie++;
			}
			else *mapp=0;
			p++;
			mapp++;
		}
	}
	g_printstr(21*8,1*8,7,0,"HI-SCORE");
	g_putfont(27*8,3*8,7,0,'0');
	g_printstr(22*8,5*8,7,0,"1UP");
	g_putfont(27*8,7*8,7,0,'0');
	displayscore();
	displayplayers();
	displayfruits();
}
void initcharacter(_Character *p,unsigned char s,unsigned short x,unsigned short y,
					unsigned char dir,unsigned short speed,unsigned char ac,unsigned short modec)
{
	//キャラクター初期化
	//p:キャラクターのポインタ、s:モード（status）、（x,y):初期位置、dir:初期方向
	//speed:移動速度、ac:アニメーションカウンタ、modec：モードカウンター
	p->status=s;
	p->x=x;
	p->y=y;
	p->oldx=x;
	p->oldy=y;
	p->dir=dir;
	p->turn=0;
	p->speed=speed;
	p->animcount=ac;
	p->animcount0=ac;
	p->animvalue=0;
	p->modecount=modec;
}

