KenKenMkIISR/rp2040-ntsc-pacman/rp2040_ntsc_pacman.c
		if(scroll2(5)) return;
		g_printstr(11*8,26*8,7,0,"BY KENKEN");
		if(scroll2(1)) return;
		g_printstr(13*8,26*8,7,0,"WITH");
		if(scroll2(1)) return;
		g_printstr(0*8,26*8,7,0,"RP2040 NTSC VIDEO OUT SYSTEM");
		if(scroll2(1)) return;
		g_printstr(5*8,26*8,7,0,"FOR RASPBERRY PI PICO");
		if(scroll2(4)) return;
		g_printstr(6*8,26*8,4,0,"PUSH START BUTTON");
		if(scroll2(1)) return;

		if(startkeycheck(600)) return;//10秒ウェイト

		g_clearscreen();
		g_printstr(5*8,2*8,2,0,"1UP");
		g_printstr(18*8,2*8,2,0,"HI-SCORE");
		g_printnum2(4*8,3*8,7,0,score,6);
		g_putfont(10*8,3*8,7,0,'0');
		g_printnum2(19*8,3*8,7,0,highscore,6);
		g_putfont(25*8,3*8,7,0,'0');
		g_printstr(4*8,6*8,7,0,"CHARACTER  /  NICKNAME");
		if(startkeycheck(50)) return;
		g_putbmpmn(3*8-3,8*8-3,XWIDTH_MONSTER,YWIDTH_MONSTER,Monsterbmp[AKABEI*8+2]);
		g_printstr(5*8,8*8,COLOR_AKABEI,0,"OIKAKE\x90\x90\x90\x90\x90\x90\x90");
		if(startkeycheck(50)) return;
		g_printstr(18*8,8*8,COLOR_AKABEI,0,"\"AKABEI\"");
		if(startkeycheck(50)) return;
		g_putbmpmn(3*8-3,10*8-3,XWIDTH_MONSTER,YWIDTH_MONSTER,Monsterbmp[PINKY*8+2]);
		g_printstr(5*8,10*8,COLOR_PINKY,0,"MACHIBUSE\x90\x90\x90\x90");
		if(startkeycheck(50)) return;
		g_printstr(18*8,10*8,COLOR_PINKY,0,"\"PINKY\"");
		if(startkeycheck(50)) return;
		g_putbmpmn(3*8-3,12*8-3,XWIDTH_MONSTER,YWIDTH_MONSTER,Monsterbmp[AOSUKE*8+2]);
		g_printstr(5*8,12*8,COLOR_AOSUKE,0,"KIMAGURE\x90\x90\x90\x90\x90");
		if(startkeycheck(50)) return;
		g_printstr(18*8,12*8,COLOR_AOSUKE,0,"\"AOSUKE\"");
		if(startkeycheck(50)) return;
		g_putbmpmn(3*8-3,14*8-3,XWIDTH_MONSTER,YWIDTH_MONSTER,Monsterbmp[GUZUTA*8+2]);
		g_printstr(5*8,14*8,COLOR_GUZUTA,0,"OTOBOKE\x90\x90\x90\x90\x90\x90");
		if(startkeycheck(50)) return;
		g_printstr(18*8,14*8,COLOR_GUZUTA,0,"\"GUZUTA\"");
		if(startkeycheck(50)) return;
		g_putfont(11*8,21*8,COLOR_COOKIE,0,CODE_COOKIE);
		g_printstr(13*8,21*8,7,0,"10 PTS");
		g_putfont(11*8,22*8,COLOR_COOKIE,0,CODE_POWERCOOKIE);
		g_printstr(13*8,22*8,7,0,"50 PTS");
		g_printstr(6*8,25*8,4,0,"PUSH START BUTTON");

		gamecount=0;
		pacx=255*256;
		akax=280*256;
		ac1=5;
		av1=0;
		a2=0;
		ac2=4;
		pacspeed=-200;
		akaspeed=-200;
		while(pacx>46*256){
			ac1--;
			if(ac1==0){
				ac1=5;
				av1++;
				if(av1==6) av1=0;
			}
			if(av1==0) a1=0;
			else if(av1<=3) a1=9+av1;
			else a1=9+6-av1;
			ac2--;
			if(ac2==0){
				ac2=4;
				a2^=1;
			}
			g_putfont(6*8,17*8,COLOR_POWERCOOKIE,0,CODE_POWERCOOKIE);
			g_putbmpmn(pacx/256,133,XWIDTH_PACMAN,YWIDTH_PACMAN,Pacmanbmp[a1]);
			g_putbmpmn(akax/256,134,XWIDTH_MONSTER,YWIDTH_MONSTER,Monsterbmp[AKABEI*8+6+a2]);
			g_putbmpmn(akax/256+18,134,XWIDTH_MONSTER,YWIDTH_MONSTER,Monsterbmp[PINKY*8+6+a2]);
			g_putbmpmn(akax/256+36,134,XWIDTH_MONSTER,YWIDTH_MONSTER,Monsterbmp[AOSUKE*8+6+a2]);
			g_putbmpmn(akax/256+54,134,XWIDTH_MONSTER,YWIDTH_MONSTER,Monsterbmp[GUZUTA*8+6+a2]);
			if(startkeycheck(1)) return;
			g_clrbmpmn(pacx/256,133,XWIDTH_PACMAN,YWIDTH_PACMAN);
			g_clrbmpmn(akax/256,134,XWIDTH_MONSTER+54,YWIDTH_MONSTER);
			pacx+=pacspeed;
			akax+=akaspeed;
			gamecount++;
			blinkpowercookie();
		}
		pacspeed=-pacspeed;
		akaspeed=100;
		i=0;
		while(i<4){
			ac1--;
			if(ac1==0){
				ac1=5;
				av1++;
				if(av1==6) av1=0;
			}
			if(av1==0) a1=0;
			else if(av1<=3) a1=3+av1;
			else a1=3+6-av1;
			ac2--;
			if(ac2==0){
				ac2=4;
				a2^=1;
			}
			if(i<=0) g_putbmpmn(akax/256,134,XWIDTH_MONSTER,YWIDTH_MONSTER,Ijikebmp[a2]);
			if(i<=1) g_putbmpmn(akax/256+18,134,XWIDTH_MONSTER,YWIDTH_MONSTER,Ijikebmp[a2]);
			if(i<=2) g_putbmpmn(akax/256+36,134,XWIDTH_MONSTER,YWIDTH_MONSTER,Ijikebmp[a2]);
			if(i<=3) g_putbmpmn(akax/256+54,134,XWIDTH_MONSTER,YWIDTH_MONSTER,Ijikebmp[a2]);
			g_putbmpmn(pacx/256,133,XWIDTH_PACMAN,YWIDTH_PACMAN,Pacmanbmp[a1]);
			if(startkeycheck(1)) return;
			g_clrbmpmn(pacx/256,133,XWIDTH_PACMAN,YWIDTH_PACMAN);
			switch(i){
				case 0:
					if(pacx/256>akax/256-6){
						i++;
						g_clrbmpmn(akax/256,134,XWIDTH_MONSTER,YWIDTH_MONSTER);
						g_putbmpmn(pacx/256,136,XWIDTH_SCORE,YWIDTH_SCORE,Scorebmp[0]);
						if(startkeycheck(30)) return;
					}
					break;
				case 1:
					if(pacx/256>akax/256+18-6){
						i++;
						g_clrbmpmn(akax/256+18,134,XWIDTH_MONSTER,YWIDTH_MONSTER);
						g_putbmpmn(pacx/256,136,XWIDTH_SCORE,YWIDTH_SCORE,Scorebmp[1]);
						if(startkeycheck(30)) return;
					}
					break;
				case 2:
					if(pacx/256>akax/256+36-6){
						i++;
						g_clrbmpmn(akax/256+36,134,XWIDTH_MONSTER,YWIDTH_MONSTER);
						g_putbmpmn(pacx/256,136,XWIDTH_SCORE,YWIDTH_SCORE,Scorebmp[2]);
						if(startkeycheck(30)) return;
					}
					break;
				case 3:
					if(pacx/256>akax/256+54-6){
						i++;
						g_clrbmpmn(akax/256+54,134,XWIDTH_MONSTER,YWIDTH_MONSTER);
						g_putbmpmn(pacx/256,136,XWIDTH_SCORE,YWIDTH_SCORE,Scorebmp[3]);
						if(startkeycheck(30)) return;
					}
			}
			g_clrbmpmn(akax/256,134,XWIDTH_MONSTER+54,YWIDTH_MONSTER);
			pacx+=pacspeed;
			akax+=akaspeed;
		}
	}
}
void game(void){
	gameinit2();//スコアなど初期化
	gamestatus=0;//0:ゲームスタート、1:ゲーム中、2:プレイヤー1減、3:ステージクリア、4:ゲームオーバー
	while(gamestatus<4){
		gameinit3();//シーンクリア、通路初期表示
		if(gamestatus==3) gamestatus=1;
		while(gamestatus<3){
			gamecount=0;//全体カウンター
			gameinit4();//パックマン、モンスター位置初期化など
			gamestart();//Ready!表示
			gamestatus=1;
			drawcount=0;
			while(gamestatus==1){
				while(drawcount==0) asm("wfi");//アイドルにして割り込み待ち
				drawcount=0;
				gamecount++;
				sound();		//効果音出力
				erasechars();	//キャラクター表示消去
				keycheck();		//ボタン押下チェック
				movechars();	//キャラクター移動
				displaychars();	//キャラクター表示
				fruitcheck();	//フルーツ関係チェック
				huntedcheck();	//食った、食われたチェック
				displayscore();	//スコア表示
			}
			sound_off();//サウンド停止
			set_palette(COLOR_POWERCOOKIE,0,255,255);//パワーえさの色標準に戻す
			if(gamestatus==2){
				deadanim(); //パックマンやられた時のアニメーション
				if(player==0) gamestatus=4;//ゲームオーバー
				else player--;
			}
			else if(gamestatus==3){
				//ステージクリア
				stageclear(); //ステージクリア時アニメーション、コーヒーブレイク
			}
		}
	}
	gameover(); //ゲーム終了処理
}

int main(void){
    stdio_init_all();

	// ボタン用GPIO設定
	gpio_init_mask(KEYSMASK);
	gpio_init_mask(GPIO_ALL_MASK);
	gpio_set_dir_in_masked(KEYSMASK);
	gpio_pull_up(GPIO_KEYUP);
	gpio_pull_up(GPIO_KEYLEFT);
	gpio_pull_up(GPIO_KEYRIGHT);
	gpio_pull_up(GPIO_KEYDOWN);
	gpio_pull_up(GPIO_KEYSTART);
	gpio_pull_up(GPIO_KEYFIRE);

	// サウンド用PWM設定
	gpio_set_function(SOUNDPORT, GPIO_FUNC_PWM);
	pwm_slice_num = pwm_gpio_to_slice_num(SOUNDPORT);
	pwm_set_wrap(pwm_slice_num, PWM_WRAP-1);
	// duty 50%
	pwm_set_chan_level(pwm_slice_num, PWM_CHAN_A, PWM_WRAP/2);

	rp2040_pwm_ntsc_init();

	highscore=1000;
	gameinit(); //ゲーム全体初期化
	while(1){
		title();//タイトル画面、スタートボタンで戻る
		game();//ゲームメインループ
	}
}
